#include "mainwindow.h"             //Подключаем заголовочный файл главного окга

#include <QApplication>             //Подключаем класс основной для любого qt


//Главная функция программы
// argc - количество аргументов командной строки
// argv - массив строк с аргументами командной строки
int main(int argc, char *argv[])
{
    //Создаем объект, управляющий русерсами приложения
    //Передаем параметры для оброботки запуска
    QApplication a(argc, argv);

    // создаем экземпляр главного окна
    MainWindow w;

    //Показываем главное окно, делаем его видимым
    w.show();

    //Запускаем цикл обработки событий
    // Программа будет работать до тех пор, пока не будет закрыто
    // последнее окно или не будет вызван exit()
    return a.exec();
}
